am/OpenFOAM-10/test/multiphase/multiphaseEulerFoam/populationBalance/drift/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 1;
    }

    bubbles
    {
        nCorr           1;
        tolerance       1e-4;
        scale           false;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  none;
        tolerance       1e-8;
        relTol          0;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "f.*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors     1;

    pRefCell        0;
    pRefValue       1e5;

    flow            yes;
    thermophysics   yes;
    models          yes;
}

relaxationFactors
{}

// ************************************************************************* //
